## Step1: install pandas

In [1]:
# !pip install pandas

## Step2: import pandas

In [2]:
import pandas as pd

###### 1(a) Create dataframe and print first five rows

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
    'Age': [24, 27, 22, 32, 29],
    'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
    'Salary': [45000, 54000, 50000, 62000, 47000]
}
df = pd.DataFrame(data)
df

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [7]:
df.head() # prints first five row of dataframe

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

###### 1(b) get summary statistics of age and salary columns

In [8]:
df[['Age', 'Salary']].describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

###### 1(c). Cal. avg salary for HR department

In [15]:
df1 = df[df['Department'] == 'HR']
df1

    Name  Age Department  Salary
0  Alice   24         HR   45000
4    Eve   29         HR   47000

In [16]:
print('Average salary for HR department: ', df1['Salary'].mean())

Average salary for HR department:  46000.0

###### 2. Add new column name 'Bonus', which is 10% of the salary

In [19]:
df['Bonus'] = df['Salary']*(10/100)

In [20]:
df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

###### 3. Filter dataframe to show employees aged between 25 and 30

In [24]:
df[(df['Age'] > 25) & (df['Age'] < 30)]

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

###### 4. Group by data by department and cal. the avg. salary for each depatment

In [27]:
avg_salary_foreachdept = df.groupby('Department')['Salary'].mean()
print('Average salary for each department: \n', avg_salary_foreachdept)

Average salary for each department:
 Department
Finance      54000.0
HR           46000.0
IT           50000.0
Marketing    62000.0
Name: Salary, dtype: float64

###### 5. Sort the dataframe by Salary in asc order and save the result to a new csv file.

In [30]:
sort_df = df.sort_values(by = 'Salary', ascending = True)

In [31]:
sort_df

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
4      Eve   29         HR   47000  4700.0
2  Charlie   22         IT   50000  5000.0
1      Bob   27    Finance   54000  5400.0
3    Diana   32  Marketing   62000  6200.0

In [32]:
# store this data in csv file

In [35]:
sort_df.to_csv('Employees_Details.csv', index= False)
print('File saved successfully')

File saved successfully